<div style="text-align:left;font-size:2em"><span style="font-weight:bolder;font-size:1.25em">SP2273 | Learning Portfolio</span><br><br><span style="font-weight:bold;color:darkred">Pandas (Need)</span></div>

In [98]:
import numpy as np
import pandas as pd
import matplotlib as mpl
import matplotlib.pyplot as plt
import seaborn as sns
plt.xkcd()

## 1 What is a dataframe

### 1.1 Reading data from csv or excel files.

In [99]:

# Your code here
df_class = pd.read_excel("dummy-class-1-of-2.xlsx", skiprows = 1)

In [100]:
df_class

,Unnamed: 0,Name,Student No,Major,Gender,Test 2 (20%),Test 1 (30%)
0,0,Braiden Henson,A3028967J,PHY,M,'18.96',20.205
1,1,Gustavo Vang,A1282849W,CHM,F,'17.44',13.470
2,2,Ronin Christian,A5408925A,PHY,M,'15.56',18.366
3,3,Owen Anderson,A6973859L,LS,F,'16.36',18.366
4,4,Kyla Young,A5410124H,PHY,M,NaN,15.306
5,5,Wyatt Oliver,A9568373Q,PHY,M,'14.088',12.246
6,6,Essence Bauer,A6824244G,LS,M,'16.72',16.530
7,7,Maryjane Sandoval,A9194090U,LS,F,'16.4',18.981
8,8,Carl Trujillo,A4828364M,LS,NB,'13.68',15.306
9,9,Halle Fritz,A4607700C,LS,F,'9.04',17.754
10,10,Marie Hoffman,A7067766E,LS,F,'16.88',19.593
11,11,Lilianna Kaufman,A5569996J,LS,M,'17.0',26.328
12,12,Jaxon Chung,A3202548I,PHY,M,'16.68',14.082
13,13,Zoey Oconnell,A6131593U,LS,F,'14.128',22.041
14,14,Quentin Kemp,A7653832E,CHM,F,'15.72',NaN
15,15,Leo Mayo,A9462811I,PHY,F,'14.68',20.817
16,16,Camden Williams,A1218599T,CHM,F,'17.648',22.653
17,17,Sidney Wiggins,A7210476B,PHY,NB,'14.68',19.593
18,18,Solomon Fletcher,A1512479K,CHM,F,'15.0',18.981
19,19,Riley Christensen,A7986368Y,CHM,F,'16.016',15.306
20,20,Malik Becker,A2727061A,PHY,M,NaN,12.858
21,21,Skylar Hensley,A2999472W,CHM,M,'17.648',23.877
22,22,Braydon Duran,A7116486E,LS,F,'14.36',15.918
23,23,Jalen Harmon,A6931452S,LS,F,'16.88',22.041
24,24,Ean Haas,A9649096H,LS,F,'14.36',19.593
25,25,Carolina Mcmahon,A1643380L,PHY,M,'18.08',12.858
26,26,Elian Potter,A6787293E,PHY,M,'14.36',23.265
27,27,Litzy White,A5975988J,PHY,NB,'15.92',20.817
28,28,Norah Miles,A3699958T,CHM,M,NaN,NaN
29,29,Mariela Sheppard,A1956366U,LS,NB,'11.0',18.366
30,30,Isabela Stokes,A1468689D,CHM,M,'16.8',18.366
31,31,Kathleen Rodriguez,A3217320C,PHY,M,'17.76',22.653
32,32,Katie Ayers,A6867791C,CBIO,F,'10.28',16.530
33,33,Tucker Sloan,A4080490P,LS,M,'15.04',17.754
34,34,Carter Crane,A7667457P,LS,M,'13.816',20.817

### 1.2 Characteristics to notice

In [101]:

# Your code here

## 2 Quick Peeks

### 2.1 Head and Tail

In [102]:

# Your code here
df_class.head(3)

,Unnamed: 0,Name,Student No,Major,Gender,Test 2 (20%),Test 1 (30%)
0,0,Braiden Henson,A3028967J,PHY,M,'18.96',20.205
1,1,Gustavo Vang,A1282849W,CHM,F,'17.44',13.470
2,2,Ronin Christian,A5408925A,PHY,M,'15.56',18.366

In [103]:
df_class.tail(3)

,Unnamed: 0,Name,Student No,Major,Gender,Test 2 (20%),Test 1 (30%)
32,32,Katie Ayers,A6867791C,CBIO,F,'10.28',16.530
33,33,Tucker Sloan,A4080490P,LS,M,'15.04',17.754
34,34,Carter Crane,A7667457P,LS,M,'13.816',20.817

### 2.2 Size and Shape

In [104]:

# Your code here
df_class.shape

(35, 7)

In [105]:
len(df_class)

35

In [106]:
df_class.columns

Index(['Unnamed: 0', 'Name', 'Student No', 'Major', 'Gender', 'Test 2 (20%)',
       'Test 1 (30%)'],
      dtype='object')

### 2.3 Summaries (I)

In [107]:

# Your code here
df_class.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 35 entries, 0 to 34
Data columns (total 7 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Unnamed: 0    35 non-null     int64
 1   Name          35 non-null     object
 2   Student No    35 non-null     object
 3   Major         35 non-null     object
 4   Gender        35 non-null     object
 5   Test 2 (20%)  32 non-null     object
 6   Test 1 (30%)  33 non-null     float64
dtypes: float64(1), int64(1), object(5)
memory usage: 2.0+ KB

In [108]:
df_class.describe()

       Unnamed: 0  Test 1 (30%)
count   35.000000     33.000000
mean    17.000000     18.534455
std     10.246951      3.487934
min      0.000000     12.246000
25%      8.500000     15.918000
50%     17.000000     18.366000
75%     25.500000     20.817000
max     34.000000     26.328000

In [109]:
df_class.describe(include="all")

,Unnamed: 0,Name,Student No,Major,Gender,Test 2 (20%),Test 1 (30%)
count,35.000000,35,35,35,35,32,33.000000
unique,NaN,35,35,4,3,27,NaN
top,NaN,Braiden Henson,A3028967J,LS,M,'14.36',NaN
freq,NaN,1,1,14,16,3,NaN
mean,17.000000,NaN,NaN,NaN,NaN,NaN,18.534455
std,10.246951,NaN,NaN,NaN,NaN,NaN,3.487934
min,0.000000,NaN,NaN,NaN,NaN,NaN,12.246000
25%,8.500000,NaN,NaN,NaN,NaN,NaN,15.918000
50%,17.000000,NaN,NaN,NaN,NaN,NaN,18.366000
75%,25.500000,NaN,NaN,NaN,NaN,NaN,20.817000
max,34.000000,NaN,NaN,NaN,NaN,NaN,26.328000

### 2.4 Summaries (II)

In [110]:

# Your code here
df_class['Test 1 (30%)'].mean()

18.534454545454548

In [111]:
df_class[['Test 1 (30%)', 'Test 2 (20%)']].mean()

/tmp/ipykernel_32974/2148427653.py:1: FutureWarning: The default value of numeric_only in DataFrame.mean is deprecated. In a future version, it will default to False. In addition, specifying 'numeric_only=None' is deprecated. Select only valid columns or specify the value of numeric_only to silence this warning.
  df_class[['Test 1 (30%)', 'Test 2 (20%)']].mean()

Test 1 (30%)    18.534455
dtype: float64

In [112]:
df_class['Major'].values

array(['PHY', 'CHM', 'PHY', 'LS', 'PHY', 'PHY', 'LS', 'LS', 'LS', 'LS',
       'LS', 'LS', 'PHY', 'LS', 'CHM', 'PHY', 'CHM', 'PHY', 'CHM', 'CHM',
       'PHY', 'CHM', 'LS', 'LS', 'LS', 'PHY', 'PHY', 'PHY', 'CHM', 'LS',
       'CHM', 'PHY', 'CBIO', 'LS', 'LS'], dtype=object)

In [113]:
df_class['Major'].unique()

array(['PHY', 'CHM', 'LS', 'CBIO'], dtype=object)

In [114]:
df_class['Major'].value_counts()

LS      14
PHY     12
CHM      8
CBIO     1
Name: Major, dtype: int64

In [115]:
df_class['Major'].value_counts().to_dict()

{'LS': 14, 'PHY': 12, 'CHM': 8, 'CBIO': 1}

In [116]:
df_class['Major'].value_counts().to_list()

[14, 12, 8, 1]

In [117]:
df_class['Major'].value_counts().index.to_list()

['LS', 'PHY', 'CHM', 'CBIO']

## 3 Housekeeping

### 3.1 Dropping unnecessary columns

In [118]:

# Your code here
df_class.drop(columns=['Unnamed: 0'])

                  Name Student No Major Gender Test 2 (20%)  Test 1 (30%)
0       Braiden Henson  A3028967J   PHY      M      '18.96'        20.205
1         Gustavo Vang  A1282849W   CHM      F      '17.44'        13.470
2      Ronin Christian  A5408925A   PHY      M      '15.56'        18.366
3        Owen Anderson  A6973859L    LS      F      '16.36'        18.366
4           Kyla Young  A5410124H   PHY      M          NaN        15.306
5         Wyatt Oliver  A9568373Q   PHY      M     '14.088'        12.246
6        Essence Bauer  A6824244G    LS      M      '16.72'        16.530
7    Maryjane Sandoval  A9194090U    LS      F       '16.4'        18.981
8        Carl Trujillo  A4828364M    LS     NB      '13.68'        15.306
9          Halle Fritz  A4607700C    LS      F       '9.04'        17.754
10       Marie Hoffman  A7067766E    LS      F      '16.88'        19.593
11    Lilianna Kaufman  A5569996J    LS      M       '17.0'        26.328
12         Jaxon Chung  A3202548I   PHY      M      '16.68'        14.082
13       Zoey Oconnell  A6131593U    LS      F     '14.128'        22.041
14        Quentin Kemp  A7653832E   CHM      F      '15.72'           NaN
15            Leo Mayo  A9462811I   PHY      F      '14.68'        20.817
16     Camden Williams  A1218599T   CHM      F     '17.648'        22.653
17      Sidney Wiggins  A7210476B   PHY     NB      '14.68'        19.593
18    Solomon Fletcher  A1512479K   CHM      F       '15.0'        18.981
19   Riley Christensen  A7986368Y   CHM      F     '16.016'        15.306
20        Malik Becker  A2727061A   PHY      M          NaN        12.858
21      Skylar Hensley  A2999472W   CHM      M     '17.648'        23.877
22       Braydon Duran  A7116486E    LS      F      '14.36'        15.918
23        Jalen Harmon  A6931452S    LS      F      '16.88'        22.041
24            Ean Haas  A9649096H    LS      F      '14.36'        19.593
25    Carolina Mcmahon  A1643380L   PHY      M      '18.08'        12.858
26        Elian Potter  A6787293E   PHY      M      '14.36'        23.265
27         Litzy White  A5975988J   PHY     NB      '15.92'        20.817
28         Norah Miles  A3699958T   CHM      M          NaN           NaN
29    Mariela Sheppard  A1956366U    LS     NB       '11.0'        18.366
30      Isabela Stokes  A1468689D   CHM      M       '16.8'        18.366
31  Kathleen Rodriguez  A3217320C   PHY      M      '17.76'        22.653
32         Katie Ayers  A6867791C  CBIO      F      '10.28'        16.530
33        Tucker Sloan  A4080490P    LS      M      '15.04'        17.754
34        Carter Crane  A7667457P    LS      M     '13.816'        20.817

In [119]:
# Pandas methods modify the dataframe in place
df_class.head()

,Unnamed: 0,Name,Student No,Major,Gender,Test 2 (20%),Test 1 (30%)
0,0,Braiden Henson,A3028967J,PHY,M,'18.96',20.205
1,1,Gustavo Vang,A1282849W,CHM,F,'17.44',13.470
2,2,Ronin Christian,A5408925A,PHY,M,'15.56',18.366
3,3,Owen Anderson,A6973859L,LS,F,'16.36',18.366
4,4,Kyla Young,A5410124H,PHY,M,NaN,15.306

In [120]:
df_class = df_class.drop(columns=['Unnamed: 0'])

### 3.2 Reorganising columns

In [121]:

# Your code here
columns_to_keep = ['Student No', 'Name', 'Major', 'Gender',
                   'Test 1 (30%)', 'Test 2 (20%)']

df_class = df_class[columns_to_keep]

### 3.3 Renaming columns

In [122]:

# Your code here
new_column_info = {'Student No': 'MATRIC_NO',
                   'Test 1 (30%)': 'Test 1',
                   'Test 2 (20%)': 'Test 2'}

df_class.rename(columns=new_column_info, inplace=True)

In [123]:
df_class.head()

   MATRIC_NO             Name Major Gender  Test 1   Test 2
0  A3028967J   Braiden Henson   PHY      M  20.205  '18.96'
1  A1282849W     Gustavo Vang   CHM      F  13.470  '17.44'
2  A5408925A  Ronin Christian   PHY      M  18.366  '15.56'
3  A6973859L    Owen Anderson    LS      F  18.366  '16.36'
4  A5410124H       Kyla Young   PHY      M  15.306      NaN

### 3.4 Setting the index

In [124]:

# Your code here
df_class.index

RangeIndex(start=0, stop=35, step=1)

In [125]:
df_class.set_index('MATRIC_NO', drop=False, inplace=True)

In [126]:
df_class.head()

           MATRIC_NO             Name Major Gender  Test 1   Test 2
MATRIC_NO
A3028967J  A3028967J   Braiden Henson   PHY      M  20.205  '18.96'
A1282849W  A1282849W     Gustavo Vang   CHM      F  13.470  '17.44'
A5408925A  A5408925A  Ronin Christian   PHY      M  18.366  '15.56'
A6973859L  A6973859L    Owen Anderson    LS      F  18.366  '16.36'
A5410124H  A5410124H       Kyla Young   PHY      M  15.306      NaN

### 3.5 Applying changes

In [127]:

# Your code here
df_class['Major'].unique()

array(['PHY', 'CHM', 'LS', 'CBIO'], dtype=object)

In [128]:
df_class['Gender'].unique()

array(['M', 'F', 'NB'], dtype=object)

In [129]:
replace_info = {
    'PHY': 'Physics',
    'CHM': 'Chemistry',
    'LS': 'Life Sciences',
    'CBIO': 'Comp. Biology',
    'F': 'Female',
    'M': 'Male',
    'NB': 'Non-binary'
}

df_class.replace(to_replace=replace_info, inplace=True)

In [130]:
def clean(text):
    try:
        return text.replace("'", "")
    except AttributeError:
        # This will handle the NaN of the missing data
        return text

df_class["Test 2"].apply(clean)

MATRIC_NO
A3028967J     18.96
A1282849W     17.44
A5408925A     15.56
A6973859L     16.36
A5410124H       NaN
A9568373Q    14.088
A6824244G     16.72
A9194090U      16.4
A4828364M     13.68
A4607700C      9.04
A7067766E     16.88
A5569996J      17.0
A3202548I     16.68
A6131593U    14.128
A7653832E     15.72
A9462811I     14.68
A1218599T    17.648
A7210476B     14.68
A1512479K      15.0
A7986368Y    16.016
A2727061A       NaN
A2999472W    17.648
A7116486E     14.36
A6931452S     16.88
A9649096H     14.36
A1643380L     18.08
A6787293E     14.36
A5975988J     15.92
A3699958T       NaN
A1956366U      11.0
A1468689D      16.8
A3217320C     17.76
A6867791C     10.28
A4080490P     15.04
A7667457P    13.816
Name: Test 2, dtype: object

### 3.6 Changing Column Type

In [131]:

# Your code here
df_class.info()

<class 'pandas.core.frame.DataFrame'>
Index: 35 entries, A3028967J to A7667457P
Data columns (total 6 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   MATRIC_NO  35 non-null     object
 1   Name       35 non-null     object
 2   Major      35 non-null     object
 3   Gender     35 non-null     object
 4   Test 1     33 non-null     float64
 5   Test 2     32 non-null     object
dtypes: float64(1), object(5)
memory usage: 3.0+ KB

In [132]:
# str is a vectorised string operation for pandas series
# Remove the quotes from the dataframe
df_class["Test 2"] = df_class["Test 2"].str.replace("'", "")

In [133]:
new_type_info = {'Major': 'category',
                 'Gender': 'category',
                 'Test 2': 'float'}

# atype does NOT have an inplace option`
df_class = df_class.astype(new_type_info)

In [134]:
df_class.info()

<class 'pandas.core.frame.DataFrame'>
Index: 35 entries, A3028967J to A7667457P
Data columns (total 6 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   MATRIC_NO  35 non-null     object
 1   Name       35 non-null     object
 2   Major      35 non-null     category
 3   Gender     35 non-null     category
 4   Test 1     33 non-null     float64
 5   Test 2     32 non-null     float64
dtypes: category(2), float64(2), object(2)
memory usage: 2.8+ KB

### 3.7 Adding a new column

In [135]:

# Your code here
df_class["Total"] = df_class["Test 1"] + df_class["Test 2"]

### 3.8 Saving to file

In [136]:

# Your code here
df_class.to_excel('finalised_scores.xlsx', index=False)

### 3.9 The recipe so far

In [137]:

# Your code here

## 4 Asking questions

### 4.1 Locating data

In [138]:

# iloc: Using indexes
df_class.iloc[10:13, 2:4]

                   Major  Gender
MATRIC_NO
A7067766E  Life Sciences  Female
A5569996J  Life Sciences    Male
A3202548I        Physics    Male

In [139]:
# loc: Using labels
df_class.loc[['A7067766E', 'A5569996J', 'A3202548I'], ['Major', 'Gender']]

                   Major  Gender
MATRIC_NO
A7067766E  Life Sciences  Female
A5569996J  Life Sciences    Male
A3202548I        Physics    Male

### 4.2 Asking questions with masks

In [140]:

# Your code here
# Selects the column
df_class["Major"] == "Chemistry"

MATRIC_NO
A3028967J    False
A1282849W     True
A5408925A    False
A6973859L    False
A5410124H    False
A9568373Q    False
A6824244G    False
A9194090U    False
A4828364M    False
A4607700C    False
A7067766E    False
A5569996J    False
A3202548I    False
A6131593U    False
A7653832E     True
A9462811I    False
A1218599T     True
A7210476B    False
A1512479K     True
A7986368Y     True
A2727061A    False
A2999472W     True
A7116486E    False
A6931452S    False
A9649096H    False
A1643380L    False
A6787293E    False
A5975988J    False
A3699958T     True
A1956366U    False
A1468689D     True
A3217320C    False
A6867791C    False
A4080490P    False
A7667457P    False
Name: Major, dtype: bool

In [141]:
df_class.loc[:, 'Major'] == "Chemistry"

MATRIC_NO
A3028967J    False
A1282849W     True
A5408925A    False
A6973859L    False
A5410124H    False
A9568373Q    False
A6824244G    False
A9194090U    False
A4828364M    False
A4607700C    False
A7067766E    False
A5569996J    False
A3202548I    False
A6131593U    False
A7653832E     True
A9462811I    False
A1218599T     True
A7210476B    False
A1512479K     True
A7986368Y     True
A2727061A    False
A2999472W     True
A7116486E    False
A6931452S    False
A9649096H    False
A1643380L    False
A6787293E    False
A5975988J    False
A3699958T     True
A1956366U    False
A1468689D     True
A3217320C    False
A6867791C    False
A4080490P    False
A7667457P    False
Name: Major, dtype: bool

In [142]:
df_class.loc[df_class['Major'] == 'Chemistry']

,MATRIC_NO,Name,Major,Gender,Test 1,Test 2,Total
MATRIC_NO,,,,,,,
A1282849W,A1282849W,Gustavo Vang,Chemistry,Female,13.470,17.440,30.910
A7653832E,A7653832E,Quentin Kemp,Chemistry,Female,NaN,15.720,NaN
A1218599T,A1218599T,Camden Williams,Chemistry,Female,22.653,17.648,40.301
A1512479K,A1512479K,Solomon Fletcher,Chemistry,Female,18.981,15.000,33.981
A7986368Y,A7986368Y,Riley Christensen,Chemistry,Female,15.306,16.016,31.322
A2999472W,A2999472W,Skylar Hensley,Chemistry,Male,23.877,17.648,41.525
A3699958T,A3699958T,Norah Miles,Chemistry,Male,NaN,NaN,NaN
A1468689D,A1468689D,Isabela Stokes,Chemistry,Male,18.366,16.800,35.166

In [143]:
# Using the invert bitwise operator to invert the boolean series
df_class.loc[~(df_class['Major'] == 'Life Sciences')]

,MATRIC_NO,Name,Major,Gender,Test 1,Test 2,Total
MATRIC_NO,,,,,,,
A3028967J,A3028967J,Braiden Henson,Physics,Male,20.205,18.960,39.165
A1282849W,A1282849W,Gustavo Vang,Chemistry,Female,13.470,17.440,30.910
A5408925A,A5408925A,Ronin Christian,Physics,Male,18.366,15.560,33.926
A5410124H,A5410124H,Kyla Young,Physics,Male,15.306,NaN,NaN
A9568373Q,A9568373Q,Wyatt Oliver,Physics,Male,12.246,14.088,26.334
A3202548I,A3202548I,Jaxon Chung,Physics,Male,14.082,16.680,30.762
A7653832E,A7653832E,Quentin Kemp,Chemistry,Female,NaN,15.720,NaN
A9462811I,A9462811I,Leo Mayo,Physics,Female,20.817,14.680,35.497
A1218599T,A1218599T,Camden Williams,Chemistry,Female,22.653,17.648,40.301
A7210476B,A7210476B,Sidney Wiggins,Physics,Non-binary,19.593,14.680,34.273
A1512479K,A1512479K,Solomon Fletcher,Chemistry,Female,18.981,15.000,33.981
A7986368Y,A7986368Y,Riley Christensen,Chemistry,Female,15.306,16.016,31.322
A2727061A,A2727061A,Malik Becker,Physics,Male,12.858,NaN,NaN
A2999472W,A2999472W,Skylar Hensley,Chemistry,Male,23.877,17.648,41.525
A1643380L,A1643380L,Carolina Mcmahon,Physics,Male,12.858,18.080,30.938
A6787293E,A6787293E,Elian Potter,Physics,Male,23.265,14.360,37.625
A5975988J,A5975988J,Litzy White,Physics,Non-binary,20.817,15.920,36.737
A3699958T,A3699958T,Norah Miles,Chemistry,Male,NaN,NaN,NaN
A1468689D,A1468689D,Isabela Stokes,Chemistry,Male,18.366,16.800,35.166
A3217320C,A3217320C,Kathleen Rodriguez,Physics,Male,22.653,17.760,40.413
A6867791C,A6867791C,Katie Ayers,Comp. Biology,Female,16.530,10.280,26.810

In [144]:
# Create mask
mask = (df_class["Major"] == "Chemistry") & (df_class["Gender"] == 'Female')

# Using mask
# Uses the mask to select the rows, only returns the selected columns
df_class.loc[mask, ["Name", "Major", "Gender"]]

                        Name      Major  Gender
MATRIC_NO
A1282849W       Gustavo Vang  Chemistry  Female
A7653832E       Quentin Kemp  Chemistry  Female
A1218599T    Camden Williams  Chemistry  Female
A1512479K   Solomon Fletcher  Chemistry  Female
A7986368Y  Riley Christensen  Chemistry  Female

In [145]:
mask = df_class["Test 1"] < 15
df_class.loc[mask, ["Name", "Major", "Test 1"]]

                       Name      Major  Test 1
MATRIC_NO
A1282849W      Gustavo Vang  Chemistry  13.470
A9568373Q      Wyatt Oliver    Physics  12.246
A3202548I       Jaxon Chung    Physics  14.082
A2727061A      Malik Becker    Physics  12.858
A1643380L  Carolina Mcmahon    Physics  12.858

### 4.3 The magic of groupby()

In [146]:

# Your code here
df_class.groupby(by=['Major']).mean()

/tmp/ipykernel_32974/4179530093.py:2: FutureWarning: The default value of numeric_only in DataFrameGroupBy.mean is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  df_class.groupby(by=['Major']).mean()

                Test 1     Test 2      Total
Major
Chemistry      18.7755  16.610286  35.534167
Comp. Biology  16.5300  10.280000  26.810000
Life Sciences  19.2420  14.690286  33.932286
Physics        17.7555  16.076800  34.567000

In [147]:
df_class.groupby(by=['Major', 'Gender']).mean()

/tmp/ipykernel_32974/3067224352.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.mean is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  df_class.groupby(by=['Major', 'Gender']).mean()

                             Test 1     Test 2      Total
Major         Gender
Chemistry     Female      17.602500  16.364800  34.128500
              Male        21.121500  17.224000  38.345500
              Non-binary        NaN        NaN        NaN
Comp. Biology Female      16.530000  10.280000  26.810000
              Male              NaN        NaN        NaN
              Non-binary        NaN        NaN        NaN
Life Sciences Female      19.285875  14.801000  34.086875
              Male        20.357250  15.644000  36.001250
              Non-binary  16.836000  12.340000  29.176000
Physics       Female      20.817000  14.680000  35.497000
              Male        16.871000  16.498286  34.166143
              Non-binary  20.205000  15.300000  35.505000

In [148]:
# Don't create a new index based on the grouped categories
df_class.groupby(by=['Major', 'Gender'], as_index=False).mean()

/tmp/ipykernel_32974/483437798.py:2: FutureWarning: The default value of numeric_only in DataFrameGroupBy.mean is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  df_class.groupby(by=['Major', 'Gender'], as_index=False).mean()

            Major      Gender     Test 1     Test 2      Total
0       Chemistry      Female  17.602500  16.364800  34.128500
1       Chemistry        Male  21.121500  17.224000  38.345500
2       Chemistry  Non-binary        NaN        NaN        NaN
3   Comp. Biology      Female  16.530000  10.280000  26.810000
4   Comp. Biology        Male        NaN        NaN        NaN
5   Comp. Biology  Non-binary        NaN        NaN        NaN
6   Life Sciences      Female  19.285875  14.801000  34.086875
7   Life Sciences        Male  20.357250  15.644000  36.001250
8   Life Sciences  Non-binary  16.836000  12.340000  29.176000
9         Physics      Female  20.817000  14.680000  35.497000
10        Physics        Male  16.871000  16.498286  34.166143
11        Physics  Non-binary  20.205000  15.300000  35.505000

In [149]:
# Select a specific column from the returned dataframe
df_class.groupby(by=["Major", "Gender"])["Test 1"].mean()

Major          Gender
Chemistry      Female        17.602500
               Male          21.121500
               Non-binary          NaN
Comp. Biology  Female        16.530000
               Male                NaN
               Non-binary          NaN
Life Sciences  Female        19.285875
               Male          20.357250
               Non-binary    16.836000
Physics        Female        20.817000
               Male          16.871000
               Non-binary    20.205000
Name: Test 1, dtype: float64

In [150]:
# Using agg to obtain information using mulitple functions instead of just one
df_class.groupby(by=['Major', 'Gender']).agg([np.mean, np.std]).round(2)

/tmp/ipykernel_32974/1237069997.py:2: FutureWarning: ['MATRIC_NO', 'Name'] did not aggregate successfully. If any error is raised this will raise in a future version of pandas. Drop these columns/ops to avoid this warning.
  df_class.groupby(by=['Major', 'Gender']).agg([np.mean, np.std]).round(2)

                         Test 1       Test 2        Total
                           mean   std   mean   std   mean   std
Major         Gender
Chemistry     Female      17.60  4.07  16.36  1.14  34.13  4.33
              Male        21.12  3.90  17.22  0.60  38.35  4.50
              Non-binary    NaN   NaN    NaN   NaN    NaN   NaN
Comp. Biology Female      16.53   NaN  10.28   NaN  26.81   NaN
              Male          NaN   NaN    NaN   NaN    NaN   NaN
              Non-binary    NaN   NaN    NaN   NaN    NaN   NaN
Life Sciences Female      19.29  2.07  14.80  2.61  34.09  3.84
              Male        20.36  4.37  15.64  1.49  36.00  4.95
              Non-binary  16.84  2.16  12.34  1.90  29.18  0.27
Physics       Female      20.82   NaN  14.68   NaN  35.50   NaN
              Male        16.87  4.35  16.50  1.89  34.17  5.15
              Non-binary  20.20  0.87  15.30  0.88  35.50  1.74

In [151]:
# Agg works with any dataframe
df_class.agg([np.mean, np.std]).round(2)

/tmp/ipykernel_32974/3697240410.py:2: FutureWarning: ['MATRIC_NO', 'Name', 'Major', 'Gender'] did not aggregate successfully. If any error is raised this will raise in a future version of pandas. Drop these columns/ops to avoid this warning.
  df_class.agg([np.mean, np.std]).round(2)

      Test 1  Test 2  Total
mean   18.53   15.41  34.22
std     3.49    2.23   4.37

In [152]:
# Filtering the dataframe for female first, then running groupby on the resultant dataframe
mask = df_class['Gender'] == 'Female'
df_class[mask].groupby(by=['Major']).mean()

/tmp/ipykernel_32974/1870287050.py:3: FutureWarning: The default value of numeric_only in DataFrameGroupBy.mean is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  df_class[mask].groupby(by=['Major']).mean()

                  Test 1   Test 2      Total
Major
Chemistry      17.602500  16.3648  34.128500
Comp. Biology  16.530000  10.2800  26.810000
Life Sciences  19.285875  14.8010  34.086875
Physics        20.817000  14.6800  35.497000

In [153]:
df_class.groupby(by=['Gender', 'Major']).mean()

/tmp/ipykernel_32974/1410623001.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.mean is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  df_class.groupby(by=['Gender', 'Major']).mean()

                             Test 1     Test 2      Total
Gender     Major
Female     Chemistry      17.602500  16.364800  34.128500
           Comp. Biology  16.530000  10.280000  26.810000
           Life Sciences  19.285875  14.801000  34.086875
           Physics        20.817000  14.680000  35.497000
Male       Chemistry      21.121500  17.224000  38.345500
           Comp. Biology        NaN        NaN        NaN
           Life Sciences  20.357250  15.644000  36.001250
           Physics        16.871000  16.498286  34.166143
Non-binary Chemistry            NaN        NaN        NaN
           Comp. Biology        NaN        NaN        NaN
           Life Sciences  16.836000  12.340000  29.176000
           Physics        20.205000  15.300000  35.505000

## Exercise 1 :  Another dummy class

In [154]:
dummy_class = pd.read_excel("another-dummy-class.xlsx")

ImportError: Missing optional dependency 'xlrd'. Install xlrd >= 1.0.0 for Excel support Use pip or conda to install xlrd.

In [ ]:
dummy_class.drop(columns="Unnamed: 0", inplace=True)

In [ ]:
# Names of female physicists in class
dummy_class[dummy_class["Gender"] == "Female"]["Name"]

In [ ]:
major_stats = dummy_class.groupby(by=['Major', 'Gender'], as_index=False).size()
major_stats

In [ ]:
major_stats_nogender = dummy_class.groupby(by=['Major'], as_index=False).size()
major_stats_nogender.sort_values(by=['size'], ascending=False, inplace=True)
major_stats_nogender

In [ ]:
# Plotting the figure
fig, ax = plt.subplots()
ax.bar(major_stats_nogender["Major"], major_stats_nogender["size"])
ax.set_title("Number of students in each major")

In [ ]:
# Using the hints
major_stats_nogender_2 = dummy_class["Major"].value_counts()
major_stats_nogender_2 = major_stats_nogender_2.to_dict()
fig2, ax2 = plt.subplots()
ax2.bar(major_stats_nogender_2.keys(), major_stats_nogender_2.values())
ax2.set_title("Number of students in each major")

In [ ]:
# Using pandas built in plots
dummy_class["Major"].value_counts().plot(kind="bar")

In [ ]:
# Using Seaborn
fig2 = sns.displot(data=dummy_class, x="Major")
fig2.set(title="Number of students in each major")